################全局变量和局部变量名字相同###############
a = 100
def test():
    a = 200  #优先选择局部变量用
    print("a = %d"%a)  #%d代表10进制整数

def test2():
    print("a = %d" % a)


test()
test2()

################################全局变量定义位置################################
#只要定义在调用函数之前就行，最好是放在定义的函数之前
#全局变量定义在函数前面
a = 100
#建议定义全局变量时最好加g_
g_a = 100
def test():
    a = 200  #优先选择局部变量用
    print("a = %d"%a)
    print("b = %d"%b)
    print("c = %d"%c)
#全局变量定义在函数后边
b = 200

test()
##全局变量定义在调用函数后边
#c = 300  #这种情况不行，因为调用已经结束，而调用的函数里面没有c这个变量
